#+TITLE: 750words command-line client
#+author: Diego Zamboni
#+email: diego@zzamboni.org

A simple client for posting text to your [[https://750words.com/][750words.com]] account. Can also be used to query your current word count or the current text.

You can see its annotated source code in the [[https://github.com/zzamboni/750words-client/blob/main/750words-client.org][750words-client.org]] file, but the file you run is [[https://github.com/zzamboni/750words-client/blob/main/750words-client.py][750words-client.py]].

* Installation

** Docker image

[[[https://hub.docker.com/r/zzamboni/750words-client][750words-client on Docker Hub]]][[[https://github.com/zzamboni/750words-client/blob/main/Dockerfile][Dockerfile]]]

You can use =750words-client.py= from its Docker image as follows (the image will be downloaded from [[https://hub.docker.com/r/zzamboni/750words-client][Docker Hub]] the first time you use it):

#+begin_src bash
docker run zzamboni/750words-client --help
#+end_src

Note: you need to pass the =-i= option to =docker run= if you want to read the input from standard input, e.g.:

#+begin_src bash
cat file.txt | docker run -i zzamboni/750words-client
#+end_src

If you want to build the image yourself, you can do it as follows from a checkout of its [[https://github.com/zzamboni/750words-client][git repository]]:

#+begin_src bash
docker build --tag 750words-client .
#+end_src

** Local installation

Clone this repository:

#+begin_src bash
git clone https://github.com/zzamboni/750words-client.git
#+end_src

You need the following libraries and components installed:

- [[https://selenium-python.readthedocs.io/][Selenium]] Python bindings (run =pip install -r requirements.txt=)
- [[https://www.google.com/chrome/][Google Chrome]] is used to automate the connections.
- [[https://chromedriver.chromium.org/][ChromeDriver]] so that Selenium can connect to Chrome - make sure you install the version that corresponds to the Chrome version you have installed.

You can then copy =750words.py= to somewhere in your =$PATH= to use it.

* Usage

#+begin_src bash :results output :exports both
750words-client.py --help
#+end_src

#+RESULTS:
#+begin_example
usage: 750words-client.py [-h] [--min MIN] [--max MAX] [--only-if-needed]
                          [--replace] [--count] [--text] [--no-headless]
                          [--quiet]
                          [FILE ...]

Interact with 750words.com from the command line.

positional arguments:
  FILE              Input files for text to add. Default is to read from
                    standard input.

optional arguments:
  -h, --help        show this help message and exit
  --min MIN         Minimum number of words needed. Default: 750.
  --max MAX         Maximum total number of words allowed. Default: 5000.
  --only-if-needed  Only add text if current word count is below MIN.
  --replace         Replace any current text with the new one, default is to
                    add at the end.
  --count           Don't upload text, only print the current word count.
  --text            Don't upload text, only print the current text.
  --no-headless     Disable headless mode (opens the Chrome app window).
  --quiet           Don't print progress messages.

Your 750words.com credentials must be stored in the USER_750WORDS and
PASS_750WORDS environment variables.
#+end_example
